---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.StairsPathDirection.AlwaysUp
enum: Autodesk.Revit.DB.Architecture.StairsPathDirection
source: html/e998027f-18a6-d878-0e34-c589ab74d586.htm
---
# Autodesk.Revit.DB.Architecture.StairsPathDirection.AlwaysUp

The direction of the stair path will always be UP direction.